posts/hazimemashita/index.org
#+BEGIN_COMMENT
.. title: はじめました
.. slug: hazimemashita
.. date: 2017-08-11 13:57:57 UTC+09:00
.. tags: mathjax
.. category:
.. link:
.. description:
.. type: text
#+END_COMMENT

nikolaでブログはじめました。

{{{TEASER_END}}}

github pagesはサイトジェネレータとしてjekyllをデフォルトで使う。jekyllはrubyで書かれているが、自分はrubyをよく知らないのでいまいち使いづらく、ちょっと触ってから放置してた。

そんなときにpythonで作られたNikolaというのがあると知った。pythonならrubyより詳しく知ってるので、これを使って再チャレンジすることにした。

以下設定してみて感じたこと
  - インストールが簡単
    - pipで全部入る。virutualenvで少し手間取ったけどこれは私がこれについてよく知らなかったせい。
  - 記事書くのも簡単
    - ~nikola new_post~ で終わり
  - org-modeで記事を書くための公式のプラグインがある。
    - 今それで書いてる。org-modeも一緒に習得できてお得。
  - github pages と連携している
    - 記事を書いたら ~nikola github_deploy~ でgitのブランチの作成、コミット、プッシュまで全部やって、サイトが見れる状態にしてくれる。
  -  設定がpythonで書かれている
     - pythonで書かれているのだから当たり前だが、読みやすくて嬉しい。例えば ~COMPILERS["orgmode"] = ('.org', )~ と書かれていたときに、「あぁこれはCOMPILERSという辞書に新しい要素を追加しているのだな」分かるのは大きい。
  - \(\LaTeX\)表記に対応している
    - ただ、記事に"mathjax"というタグを付けないといけないというのは分かりづらいと思う。
  - 日本語に対応してる
    - 例えばトップページにある"続きを読む"のリンクはNikolaが追加したもの。

続くかな。
