posts/hazimemashita/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="ja">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width">
<title>はじめました | iiyuki's blog</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<link rel="canonical" href="https://yuki67.github.io/posts/hazimemashita/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="iiyuki">
<meta property="og:site_name" content="iiyuki's blog">
<meta property="og:title" content="はじめました">
<meta property="og:url" content="https://yuki67.github.io/posts/hazimemashita/">
<meta property="og:description" content="nikolaでブログはじめました。





github pagesはサイトジェネレータとしてjekyllをデフォルトで使う。jekyllはrubyで書かれているが、自分はrubyをよく知らないのでいまいち使いづらく、ちょっと触ってから放置してた。



そんなときにpythonで作られたNikolaというのがあると知った。pythonならrubyより詳しく知ってるので、これを使って再チャレンジ">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2017-08-11T13:57:57+09:00">
<meta property="article:tag" content="mathjax">
</head>
<body>
    <section class="social"><ul>
<li><a href="../../index.html" title="Home"><i class="icon-home"></i></a></li>
            <li><a href="../../archive.html" title="Archives"><i class="icon-folder-open-alt"></i></a></li>
            <li><a href="../../categories/index.html" title="Tags"><i class="icon-tags"></i></a></li>
            <li><a href="../../rss.xml" title="RSS"><i class="icon-rss"></i></a></li>
            <li><a href="../../pages/about/" title="About me"><i class="icon-user"></i></a></li>
            <li><a href="https://twitter.com/" title="My Twitter"><i class="icon-twitter"></i></a></li>
            <li><a href="https://github.com/yuki67" title="My Github"><i class="icon-github"></i></a></li>

        </ul></section><section class="page-content"><div class="content" rel="main">
            
    <div class="post">
    
    <h1 class="p-name entry-title" itemprop="headline name">はじめました</h1>

        <div class="meta">
            <div class="authordate">
                <time class="timeago" datetime="2017-08-11T13:57:57+09:00">2017-08-11 13:57</time>
            

            
          |  
        <a href="index.org" id="sourcelink">ソース</a>

            </div>
            
        <div itemprop="keywords" class="tags">
        <ul>
        タグ : 
           <li><a class="tag p-category" href="../../categories/mathjax/" rel="tag">mathjax</a></li>
        </ul>
</div>

        </div>
        <div class="body">
            <p>
nikolaでブログはじめました。
</p>

<!-- TEASER_END -->

<p>
github pagesはサイトジェネレータとしてjekyllをデフォルトで使う。jekyllはrubyで書かれているが、自分はrubyをよく知らないのでいまいち使いづらく、ちょっと触ってから放置してた。
</p>

<p>
そんなときにpythonで作られたNikolaというのがあると知った。pythonならrubyより詳しく知ってるので、これを使って再チャレンジすることにした。
</p>

<p>
以下設定してみて感じたこと
</p>
<ul class="org-ul">
<li>インストールが簡単
<ul class="org-ul">
<li>pipで全部入る。virutualenvで少し手間取ったけどこれは私がこれについてよく知らなかったせい。
</li>
</ul>
</li>
<li>記事書くのも簡単
<ul class="org-ul">
<li>
<code>nikola new_post</code> で終わり
</li>
</ul>
</li>
<li>org-modeで記事を書くための公式のプラグインがある。
<ul class="org-ul">
<li>今それで書いてる。org-modeも一緒に習得できてお得。
</li>
</ul>
</li>
<li>github pages と連携している
<ul class="org-ul">
<li>記事を書いたら <code>nikola github_deploy</code> でgitのブランチの作成、コミット、プッシュまで全部やって、サイトが見れる状態にしてくれる。
</li>
</ul>
</li>
<li>設定がpythonで書かれている
<ul class="org-ul">
<li>pythonで書かれているのだから当たり前だが、読みやすくて嬉しい。例えば <code>COMPILERS["orgmode"] = ('.org', )</code> と書かれていたときに、「あぁこれはCOMPILERSという辞書に新しい要素を追加しているのだな」分かるのは大きい。
</li>
</ul>
</li>
<li>\(\LaTeX\)表記に対応している
<ul class="org-ul">
<li>ただ、記事に"mathjax"というタグを付けないといけないというのは分かりづらいと思う。
</li>
</ul>
</li>
<li>日本語に対応してる
<ul class="org-ul">
<li>例えばトップページにある"続きを読む"のリンクはNikolaが追加したもの。
</li>
</ul>
</li>
</ul>
<p>
続くかな。
</p>
        </div>
        
        <ul class="pager hidden-print">
<li class="next">
                <a href="../montecarlo-integral/" rel="next" title="モンテカルロ積分">次の文書</a>
            </li>
        </ul>
<script src="https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.1/MathJax.js?config=TeX-AMS-MML_HTMLorMML" integrity="sha256-SDRP1VVYu+tgAGKhddBSl5+ezofHKZeI+OzxakbIe/Y=" crossorigin="anonymous"></script><script type="text/x-mathjax-config">
        MathJax.Hub.Config({tex2jax: {inlineMath: [['$latex ','$'], ['\\(','\\)']]}});
        </script>
</div>



             
        <footer id="footer"><p>Contents © 2017         <a href="mailto:123syokutaku@gmail.com">iiyuki</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         </p>
            
        </footer>
</div>
    </section><script src="../../assets/js/all-nocdn.js" type="text/javascript"></script><script type="text/javascript">
            $(function(){
                $('.timeago').timeago();
            });
        </script>
</body>
</html>
